## Staging: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 18 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| add    | `aws_ecr_lifecycle_policy.audit_logs_archiver_lambda`      |
|        | `aws_ecr_lifecycle_policy.audit_logs_lambda`               |
|        | `aws_ecr_lifecycle_policy.form_archiver_lambda`            |
|        | `aws_ecr_lifecycle_policy.nagware_lambda`                  |
|        | `aws_ecr_lifecycle_policy.reliability_dlq_consumer_lambda` |
|        | `aws_ecr_lifecycle_policy.reliability_lambda`              |
|        | `aws_ecr_lifecycle_policy.response_archiver_lambda`        |
|        | `aws_ecr_lifecycle_policy.submission_lambda`               |
|        | `aws_ecr_lifecycle_policy.vault_integrity_lambda`          |
|        | `aws_ecr_repository.audit_logs_archiver_lambda`            |
|        | `aws_ecr_repository.audit_logs_lambda`                     |
|        | `aws_ecr_repository.form_archiver_lambda`                  |
|        | `aws_ecr_repository.nagware_lambda`                        |
|        | `aws_ecr_repository.reliability_dlq_consumer_lambda`       |
|        | `aws_ecr_repository.reliability_lambda`                    |
|        | `aws_ecr_repository.response_archiver_lambda`              |
|        | `aws_ecr_repository.submission_lambda`                     |
|        | `aws_ecr_repository.vault_integrity_lambda`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.audit_logs_archiver_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "audit_logs_archiver_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "audit-logs-archiver-lambda"
    }

  # aws_ecr_lifecycle_policy.audit_logs_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "audit_logs_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "audit-logs-lambda"
    }

  # aws_ecr_lifecycle_policy.form_archiver_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "form_archiver_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "form-archiver-lambda"
    }

  # aws_ecr_lifecycle_policy.nagware_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "nagware_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "nagware-lambda"
    }

  # aws_ecr_lifecycle_policy.reliability_dlq_consumer_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "reliability_dlq_consumer_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "reliability-dlq-consumer-lambda"
    }

  # aws_ecr_lifecycle_policy.reliability_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "reliability_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "reliability-lambda"
    }

  # aws_ecr_lifecycle_policy.response_archiver_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "response_archiver_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "response-archiver-lambda"
    }

  # aws_ecr_lifecycle_policy.submission_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "submission_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "submission-lambda"
    }

  # aws_ecr_lifecycle_policy.vault_integrity_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "vault_integrity_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "vault-integrity-lambda"
    }

  # aws_ecr_repository.audit_logs_archiver_lambda will be created
  + resource "aws_ecr_repository" "audit_logs_archiver_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "audit-logs-archiver-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.audit_logs_lambda will be created
  + resource "aws_ecr_repository" "audit_logs_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "audit-logs-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.form_archiver_lambda will be created
  + resource "aws_ecr_repository" "form_archiver_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "form-archiver-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.nagware_lambda will be created
  + resource "aws_ecr_repository" "nagware_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "nagware-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.reliability_dlq_consumer_lambda will be created
  + resource "aws_ecr_repository" "reliability_dlq_consumer_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "reliability-dlq-consumer-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.reliability_lambda will be created
  + resource "aws_ecr_repository" "reliability_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "reliability-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.response_archiver_lambda will be created
  + resource "aws_ecr_repository" "response_archiver_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "response-archiver-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.submission_lambda will be created
  + resource "aws_ecr_repository" "submission_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "submission-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.vault_integrity_lambda will be created
  + resource "aws_ecr_repository" "vault_integrity_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "vault-integrity-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_repository_url_audit_logs_archiver_lambda      = (known after apply)
  + ecr_repository_url_audit_logs_lambda               = (known after apply)
  + ecr_repository_url_form_archiver_lambda            = (known after apply)
  + ecr_repository_url_nagware_lambda                  = (known after apply)
  + ecr_repository_url_reliability_dlq_consumer_lambda = (known after apply)
  + ecr_repository_url_reliability_lambda              = (known after apply)
  + ecr_repository_url_response_archiver_lambda        = (known after apply)
  + ecr_repository_url_submission_lambda               = (known after apply)
  + ecr_repository_url_vault_integrity_lambda          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.audit_logs_archiver_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.audit_logs_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.form_archiver_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.load_test_repository[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.nagware_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.reliability_dlq_consumer_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.reliability_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.response_archiver_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.submission_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.vault_integrity_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.viewer_repository"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
